## Introduction

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

In [1]:
#list comprehension

list_of_squares = []
for x in range(1,11): 
    list_of_squares.append(x**2)
print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [60]:
list_of_squares = [x**2 for x in range(1,11)]
print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [4]:
{x: x**2 for x in range(1,11)}

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

In [70]:
square_dict = {x: x**2 for x in range(1,11)}
abc = {y**0.5 for k, y in square_dict.items()}
abc

{1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0}

In [6]:
#with an if statement 
list_of_squares = [x**2 for x in range(1,11) if x%2 ==1]
list_of_squares

[1, 9, 25, 49, 81]

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [73]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/c/Users/binht/Flatiron/hbs-ds-060120/module-1/day-5-pandas-1
total 44
drwxr-xr-x 1 binht 197609     0 Jun  5 12:57 .
drwxr-xr-x 1 binht 197609     0 Jun  5 10:36 ..
drwxr-xr-x 1 binht 197609     0 Jun  5 12:12 .ipynb_checkpoints
drwxr-xr-x 1 binht 197609     0 Jun  5 10:36 data
drwxr-xr-x 1 binht 197609     0 Jun  5 10:36 img
-rw-r--r-- 1 binht 197609 43633 Jun  5 12:57 pandas-1-mark.ipynb

In [13]:
!ls -la data

total 2
drwxr-xr-x 1 binht 197609   0 Jun  5 10:36 .
drwxr-xr-x 1 binht 197609   0 Jun  5 10:53 ..
-rw-r--r-- 1 binht 197609  65 Jun  5 10:36 example1.csv
-rw-r--r-- 1 binht 197609 245 Jun  5 10:36 made_up_jobs.csv

In [74]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [17]:
! cat data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

In [19]:
example_csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [77]:
# importing pandas module 
import pandas as pd 
  
# importing csv from link 
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv") 
  
# making copy of team column 
new = data["Team"].copy() 
  
# concatenating team with name column 
# overwriting name column 
data["Name"]= data["Name"].str.cat(new, sep =", ") 
  
# display 
data

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,"Avery Bradley, Boston Celtics",Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,"Jae Crowder, Boston Celtics",Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,"John Holland, Boston Celtics",Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,"R.J. Hunter, Boston Celtics",Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,"Jonas Jerebko, Boston Celtics",Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,"Shelvin Mack, Utah Jazz",Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,"Raul Neto, Utah Jazz",Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,"Tibor Pleiss, Utah Jazz",Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,"Jeff Withey, Utah Jazz",Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
type(example_csv)

pandas.core.frame.DataFrame

In [83]:
example_csv['Title3']

0       three
1    example3
Name: Title3, dtype: object

In [82]:
example_csv.Title3
#same results

0       three
1    example3
Name: Title3, dtype: object

In [80]:
type(example_csv['Title3'])

pandas.core.series.Series

In [85]:
example_csv.Title3.values

array(['three', 'example3'], dtype=object)

In [26]:
example_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title1  2 non-null      object
 1   Title2  2 non-null      object
 2   Title3  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

In [27]:
example_csv.describe()

          Title1    Title2 Title3
count          2         2      2
unique         2         2      2
top     example1  example2  three
freq           1         1      1

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [87]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv', index_col='ID')

# remember that it's nice to be able to look at your data, so let's do that here, too.
muj.head()

             Name                       Job  Years Employed
ID
0    Bob Bobberty  Underwater Basket Weaver              13
1    Susan Smells             Salad Spinner               5
2   Alex Lastname      Productivity Manager               2
3         Rudy P.                Being cool              55
4         Rudy G.  Being compared to Rudy P              50

In [29]:
muj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              6 non-null      int64
 1   Name            6 non-null      object
 2   Job             6 non-null      object
 3   Years Employed  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [94]:
import numpy as np
random_df= pd.DataFrame(np.random.random((1000000,10)))
random_df

,0,1,2,3,4,5,6,7,8,9
0,0.186645,0.336662,0.717515,0.549207,0.418994,0.327798,0.715695,0.987866,0.159092,0.844855
1,0.842401,0.308790,0.396708,0.694473,0.756967,0.090570,0.346543,0.817001,0.893688,0.790235
2,0.359274,0.814991,0.564794,0.970733,0.836808,0.415246,0.337027,0.067810,0.179983,0.732922
3,0.821782,0.609696,0.222488,0.039795,0.811891,0.514575,0.630725,0.648280,0.041160,0.821719
4,0.406246,0.707046,0.753590,0.572240,0.797302,0.310766,0.194989,0.544150,0.278121,0.878111
...,...,...,...,...,...,...,...,...,...,...
999995,0.235805,0.770711,0.543976,0.288671,0.277721,0.881236,0.828445,0.558936,0.089343,0.903215
999996,0.841467,0.920035,0.242296,0.331529,0.642675,0.142005,0.750098,0.261182,0.571449,0.071519
999997,0.440874,0.433133,0.761590,0.192419,0.420682,0.668733,0.538054,0.065234,0.707303,0.063754
999998,0.023002,0.880813,0.734134,0.746830,0.102296,0.125461,0.507243,0.972817,0.108656,0.296953
999999,0.290979,0.257265,0.211931,0.496949,0.252344,0.555398,0.457884,0.464051,0.714861,0.924582

In [42]:
random_df.size

100000

In [47]:
pd.DataFrame([[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [49]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [95]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [96]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [105]:
list_of_lists = [['cat1','cat2'], ['dog1','dog2'], ['horse1','horse2'], ['cow1','cow2'], ['macaw1','macaw2']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(list_of_lists, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a        [cat1, cat2]
b        [dog1, dog2]
c    [horse1, horse2]
d        [cow1, cow2]
e    [macaw1, macaw2]
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [128]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [110]:
student_list = [
    {'name': 'Samantha', 'age': 18, 'city' : 'Houston'},
    {'name': 'Samantha', 'age': 19, 'city' : 'Houston'},
    {'name': 'Samantha', 'age': 20, 'city' : 'Houston'}]

student_df2 = pd.DataFrame(student_list)
student_df2

       name  age     city
0  Samantha   18  Houston
1  Samantha   19  Houston
2  Samantha   20  Houston

In [111]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [125]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.values

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
students_df.age = students_df.age.astype(float)

students_df.dtypes

name     object
age     float64
city     object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [181]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [182]:
students_df.city

1111     Houston
1145     Seattle
0096    New york
Name: city, dtype: object

In [183]:
students_df.index = students_df.index.rename('ID')
students_df

          name age      city
ID
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [184]:
students_df.columns = ['NAME 1', 'AGE', 'HOME']
students_df.head()

        NAME 1 AGE      HOME
ID
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [173]:
students_df.columns = [x.replace(' ','').upper() for x in students_df.columns]
students_df.head()

         NAME1 AGE      HOME
NAME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [191]:
student_age_change = students_df.rename(columns={"AGE": "years"})
#rename age to years

In [192]:
# Notice what happens when we print students_df

student_age_change

        NAME 1 years      HOME
ID
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [156]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'})
students_df.head()

         name1 YEARS      home
NAME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [154]:
skinny_df = students_df.drop(columns=['YEARS', 'home'])

In [197]:
#Notice again what happens if we print students_df 
students_df

        NAME 1 years      HOME
ID
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [198]:
students_df_drop = students_df.drop(columns=['years', 'HOME'])
students_df_drop

        NAME 1
ID
1111  Samantha
1145      Alex
0096     Dante

In [203]:
students_df.drop([0], axis = 0)

KeyError: '[0] not found in axis'

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [211]:
l = [1, 2, 3, 4, 5]
l.iloc[:,:]

AttributeError: 'list' object has no attribute 'iloc'

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [222]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [223]:
students_df.loc[:, 'name']

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [229]:
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [224]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [225]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [226]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [227]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [228]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [230]:
# return the last item in the last row using iloc
students_df.iloc[-1]

name       Dante
age           26
city    New york
Name: 2, dtype: object

### How would we use `.iloc` to return the last item in the last column?

In [ ]:
# return the last item in the last column using iloc

### What if we only want certain columns or rows?

In [231]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [232]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [233]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [234]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [235]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [236]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [237]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [238]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [239]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [240]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [242]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [243]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [244]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [256]:
# What should we get now?
students_df.loc[['5', '3'], ['name', 'city']]

       name      city
5  Samantha   Houston
3     Dante  New york

In [263]:
students_df.iloc[0,2]

         age     city
name
Samantha  35  Houston
Alex      17  Seattle

In [264]:
students_df.set_index("name")
students_df

KeyError: "None of ['name'] are in the columns"

In [260]:
students_df.loc[['Samantha']]

KeyError: "None of [Index(['Samantha'], dtype='object')] are in the [index]"

In [ ]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

In [ ]:
# Samantha to the end
students_df.loc['Samantha':]

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [265]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [266]:
# The statement data[‘name’] == ‘Samantha’] produces a Pandas Series with a True/False value for every row
# in the ‘data’ DataFrame, where there are “True” values for the rows where the name is “Samantha”.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [267]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [268]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [269]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [270]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []